; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	satellite6 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite7 - satellite
	instrument13 - instrument
	satellite8 - satellite
	instrument14 - instrument
	infrared0 - mode
	thermograph1 - mode
	GroundStation0 - direction
	GroundStation4 - direction
	Star3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon6)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation5)
	(supports instrument5 thermograph1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star3)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star8)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 Star3)
	(supports instrument7 infrared0)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 infrared0)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 GroundStation5)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet12)
	(supports instrument9 thermograph1)
	(supports instrument9 infrared0)
	(calibration_target instrument9 GroundStation5)
	(calibration_target instrument9 GroundStation1)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation4)
	(supports instrument10 thermograph1)
	(supports instrument10 infrared0)
	(calibration_target instrument10 GroundStation5)
	(supports instrument11 infrared0)
	(supports instrument11 thermograph1)
	(calibration_target instrument11 GroundStation1)
	(supports instrument12 thermograph1)
	(calibration_target instrument12 GroundStation2)
	(calibration_target instrument12 GroundStation5)
	(on_board instrument10 satellite6)
	(on_board instrument11 satellite6)
	(on_board instrument12 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star8)
	(supports instrument13 thermograph1)
	(supports instrument13 infrared0)
	(calibration_target instrument13 GroundStation2)
	(calibration_target instrument13 GroundStation5)
	(on_board instrument13 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Planet11)
	(supports instrument14 thermograph1)
	(supports instrument14 infrared0)
	(calibration_target instrument14 GroundStation5)
	(calibration_target instrument14 GroundStation2)
	(on_board instrument14 satellite8)
	(power_avail satellite8)
	(pointing satellite8 GroundStation5)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(pointing satellite2 Planet12)
	(pointing satellite4 Phenomenon6)
	(pointing satellite5 GroundStation1)
	(pointing satellite6 GroundStation4)
	(pointing satellite8 Phenomenon6)
	(have_image Phenomenon6 thermograph1)
	(have_image Planet7 infrared0)
	(have_image Star8 thermograph1)
	(have_image Star9 infrared0)
	(have_image Phenomenon10 thermograph1)
	(have_image Planet11 infrared0)
	(have_image Planet12 infrared0)
))

)

; plan
1. (switch_on instrument14 satellite8)
   deleted: (power_avail satellite8)
   added: (power_on instrument14)
   goals met: 0 of 13
2. (calibrate satellite8 instrument14 groundstation5)
   added: (calibrated instrument14)
   goals met: 0 of 13
3. (turn_to satellite8 planet12 groundstation5)
   deleted: (pointing satellite8 groundstation5)
   added: (pointing satellite8 planet12)
   goals met: 0 of 13
4. (take_image satellite8 planet12 instrument14 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 1 of 13
5. (turn_to satellite8 planet11 planet12)
   deleted: (pointing satellite8 planet12)
   added: (pointing satellite8 planet11)
   goals met: 1 of 13
6. (take_image satellite8 planet11 instrument14 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 2 of 13
7. (turn_to satellite8 phenomenon10 planet11)
   deleted: (pointing satellite8 planet11)
   added: (pointing satellite8 phenomenon10)
   goals met: 2 of 13
8. (turn_to satellite5 groundstation1 groundstation4)
   deleted: (pointing satellite5 groundstation4)
   added: (pointing satellite5 groundstation1)
   goals met: 3 of 13
9. (turn_to satellite4 phenomenon6 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 phenomenon6)
   goals met: 4 of 13
10. (turn_to satellite2 planet12 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 planet12)
   goals met: 5 of 13
11. (turn_to satellite0 groundstation4 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation4)
   goals met: 6 of 13
12. (take_image satellite8 phenomenon10 instrument14 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 7 of 13
13. (turn_to satellite6 groundstation4 star8)
   deleted: (pointing satellite6 star8)
   added: (pointing satellite6 groundstation4)
   goals met: 8 of 13
14. (turn_to satellite8 planet7 phenomenon10)
   deleted: (pointing satellite8 phenomenon10)
   added: (pointing satellite8 planet7)
   goals met: 8 of 13
15. (take_image satellite8 planet7 instrument14 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 9 of 13
16. (turn_to satellite8 star8 planet7)
   deleted: (pointing satellite8 planet7)
   added: (pointing satellite8 star8)
   goals met: 9 of 13
17. (take_image satellite8 star8 instrument14 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 10 of 13
18. (turn_to satellite8 star9 star8)
   deleted: (pointing satellite8 star8)
   added: (pointing satellite8 star9)
   goals met: 10 of 13
19. (take_image satellite8 star9 instrument14 infrared0)
   added: (have_image star9 infrared0)
   goals met: 11 of 13
20. (turn_to satellite8 phenomenon6 star9)
   deleted: (pointing satellite8 star9)
   added: (pointing satellite8 phenomenon6)
   goals met: 12 of 13
21. (take_image satellite8 phenomenon6 instrument14 thermograph1)
   added: (have_image phenomenon6 thermograph1)
   goals met: 13 of 13
